---
kind: property
id: P:Autodesk.Revit.DB.CylindricalSurface.Radius
source: html/66115aa4-0b8f-627f-26a5-b6bf2d6f4f1e.htm
---
# Autodesk.Revit.DB.CylindricalSurface.Radius Property

Radius of the circle that defines the base of this cylinder.

## Syntax (C#)
```csharp
public double Radius { get; }
```